[
  {
    "id": 1,
    "name": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/cy41CDG/kindpng-81724-1.png",
    "review": "A poignant and gripping tale, 'To Kill a Mockingbird' tackles themes of racial injustice and moral courage. Harper Lee's masterful storytelling captivates readers, delivering a powerful message about compassion and the search for truth. With memorable characters and a thought-provoking narrative, this classic novel remains relevant and deeply resonant.",
    "totalPages": 336,
    "rating": 4.8,
    "category": "tiction",
    "tags": ["racial","classic"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "id": 2,
    "name": "The Hate U Give",
    "author": "George Orwell",
    "image": "https://i.ibb.co/v3WxvXY/kindpng-1064993.png",
    "review": "George Orwell's '1984' is a chilling dystopian novel that paints a bleak picture of a totalitarian society. The book's themes of surveillance, manipulation, and the erosion of individual freedom are as relevant today as ever. Orwell's prophetic vision and compelling prose make this a must-read for fans of thought-provoking literature.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["dystopian", "totalitarianism"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "id": 3,
    "name": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/xSmXLMH/kindpng-2193744-1.png",
    "review": "Jane Austen's 'Pride and Prejudice' is a timeless romance novel that explores societal norms and the complexities of love. With wit, charm, and memorable characters like Elizabeth Bennet and Mr. Darcy, Austen weaves a captivating story of misunderstandings, personal growth, and the triumph of true love. A literary classic that delights readers.",
    "totalPages": 432,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["romance", "society"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "id": 4,
    "name": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/V3vdpHx/kindpng-2592315-1.png",
    "review": "F. Scott Fitzgerald's 'The Great Gatsby' is a mesmerizing portrayal of the Jazz Age and the pursuit of the American Dream. Through the eyes of the enigmatic Jay Gatsby, Fitzgerald delves into themes of wealth, love, and the emptiness that can lie behind the facade of extravagance. A brilliant work of literature.",
    "totalPages": 180,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["wealth", "love", "Dream"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "id": 5,
    "name": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/ZzmkKSs/kindpng-4022054-1.png",
    "review": "In 'The Hobbit,' J.R.R. Tolkien invites readers on a grand adventure through Middle-earth. Bilbo Baggins, a reluctant hero, embarks on a perilous quest filled with dwarves, wizards, and a fearsome dragon. Tolkien's richly imaginative world, vibrant characters, and epic storytelling make this a beloved fantasy classic that continues to enchant.",
    "totalPages": 310,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["fantasy", "adventure"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "id": 6,
    "name": "To the Lighthouse",
    "author": "Virginia Woolf",
    "image": "https://i.ibb.co/cXkSWG4/kindpng-4945926-1.png",
    "review": "Virginia Woolf's 'To the Lighthouse' is a modernist masterpiece that delves into the complexities of human experience. Through introspective prose and stream-of-consciousness narrative, Woolf explores themes of time, memory, and the intricacies of relationships. This experimental novel challenges conventional storytelling and offers a profound exploration of the human psyche.",
    "totalPages": 209,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["modernist", "experience"],
    "publisher": "Hogarth Press",
    "yearOfPublishing": 1927
  },
  {
    "id": 7,
    "name": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/L6kCg9V/kindpng-5624060-1.png",
    "review": "Paulo Coelho's 'The Alchemist' is a philosophical novel that invites readers on a transformative journey of self-discovery and following one's dreams. With its allegorical tale and deep spiritual insights, Coelho's work inspires readers to reflect on their own purpose in life and the importance of listening to their hearts.",
    "totalPages": 197,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["philosophical", "dreams"],
    "publisher": "HarperTorch",
    "yearOfPublishing": 1988
  },
  {
    "id": 8,
    "name": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co/86myt52/kindpng-7318921.png",
    "review": "Yuval Noah Harari's 'Sapiens' offers a thought-provoking exploration of human history and evolution. From the emergence of Homo sapiens to the modern age, Harari presents a sweeping narrative that challenges conventional wisdom and prompts reflection on our species' impact on the world. A captivating and enlightening journey through time.",
    "totalPages": 443,
    "rating": 4.9,
    "category": "Non-fiction",
    "tags": ["history", "evolution"],
    "publisher": "Farwah Books",
    "yearOfPublishing": 2012
  },
  {
    "id": 9,
    "name": "The Girl on the Train",
    "author": "Paula Hawkins",
    "image": "https://i.ibb.co/j82xb2t/pngwing-1.png",
    "review": "Paula Hawkins' 'The Girl on the Train' is a gripping psychological thriller that keeps readers on the edge of their seats. With its unreliable narrator and intricate web of secrets, the story unfolds with twists and turns, delivering a suspenseful and engrossing reading experience that will leave you guessing until the end.",
    "totalPages": 336,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["psychological", "mystery"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2015
  }
]